[
  {
    "name": "Revolution on a screen",
    "slug": "roas",
    "movies": [
      {
        "poster_image_id": 2,
        "title": "Off Frame AKA Revolution Until Victory, Mohanad Yaqubi (2015)",
        "content": "A meta-documentary dissecting archival footage from the Palestinian revolution. It juxtaposes guerrilla training camps, refugee resistance, and Yasser Arafat’s media diplomacy, critiquing how revolution is framed — and erased — by colonial optics."
      },
      {
        "poster_image_id": 1,
        "title": "Cumbite, Tomás Gutiérrez Alea (1964)",
        "content": "Based on Jacques Roumain’s novel, this Cuban-Haitian collaboration depicts peasants organizing against drought and neocolonial exploitation. A poetic ode to collective action, rooted in the legacy of the Haitian Revolution."
      },
      {
        "poster_image_id": 3,
        "title": "Revolution Until Victory a.k.a We Are the Palestinian People (Newsreel #65), Newreel Collective, 1973",
        "content": "A guerrilla-style documentary filmed in Jordanian refugee camps, featuring interviews with PLO (Palestine Liberation Organization) militants and footage of grassroots organizing. A time capsule of anti-imperialist solidarity during the Cold War.<br>Screaming Queens : The Riot at Compton’s Cafeteria, Victor Silverman, Susan Stryker (2005)<br>In August 1966, three years before the Stonewall Riots, a group of transgender women, drag queens, and queer patrons of San Francisco’s Compton’s Cafeteria fought back against relentless police harassment in a fiery act of defiance. When a police officer attempted to arrest a drag queen, she hurled her coffee in his face, sparking a riot that spilled into the streets."
      },
      {
        "poster_image_id": 4,
        "title": "Sambizanga, Sarah Maldoror (1972)",
        "content": "Set during Angola’s anti-colonial uprising, this groundbreaking film follows Maria, a woman searching for her husband, a revolutionary jailed by Portuguese authorities. Her journey mirrors the nation’s fight for liberation, blending personal grief with collective resistance. A raw, feminist ode to grassroots struggle and one of African cinema’s first revolutionary landmarks."
      },
      {
        "poster_image_id": 5,
        "title": "The Black Power Mixtape 1967-1975, Göran Hugo Olsson (2011)",
        "content": "Compiled from Swedish archival footage, this documentary revisits the Black Panther Party, Angela Davis, and Stokely Carmichael. A time capsule of radical Black politics."
      },
      {
        "poster_image_id": 6,
        "title": "The Revolution Will Not Be Televised, Kim Bartley & Donnacha Ó Briain (2003)",
        "content": "A documentary capturing the 2002 coup against Hugo Chávez in Venezuela. Filmed inside Miraflores Palace, it exposes media manipulation and grassroots resistance, offering a raw look at revolution in real time."
      },
      {
        "poster_image_id": 7,
        "title": "The Spook Who Sat by the Door, Ivan Dixon (1973)",
        "content": "A biting satire about Dan Freeman, the first Black CIA agent, who uses his training to orchestrate a guerrilla uprising in Chicago. Banned for decades, this film dissects systemic racism and the paradox of tokenism in institutions of power. A cult classic of Black revolutionary cinema."
      },
      {
        "poster_image_id": 8,
        "title": "Z, Costa-Gavras (1969)",
        "content": "A fictionalized account of the 1963 assassination of Greek politician Grigoris Lambrakis. Shot like a thriller, it exposes state-sponsored violence and the moral decay of authoritarian regimes. Won an Oscar but remains under-seen."
      },
      {
        "poster_image_id": 75,
        "title": "Screaming Queens : The Riot at Compton’s Cafeteria, Victor Silverman, Susan Stryker (2005)",
        "content": "In August 1966, three years before the Stonewall Riots, a group of transgender women, drag queens, and queer patrons of San Francisco’s Compton’s Cafeteria fought back against relentless police harassment in a fiery act of defiance. When a police officer attempted to arrest a drag queen, she hurled her coffee in his face, sparking a riot that spilled into the streets."
      }
    ]
  },
  {
    "name": "Queer stories that matter",
    "slug": "qstm",
    "movies": [
      {
        "poster_image_id": 58,
        "title": "Paris Is Burning, Jennie Livingston (1990)",
        "content": "A groundbreaking documentary about New York’s Black and Latinx ballroom culture of the 1980s, where drag queens, trans women, and queer outcasts compete in categories like \"voguing\" and \"realness.\" More than a film, it’s a manifesto on survival, chosen family, and the cost of assimilation."
      },
      {
        "poster_image_id": 76,
        "title": "Tangerine, Sean Baker (2015)",
        "content": "Shot entirely on iPhone, this raucous day-in-the-life tale follows Sin-Dee Rella, a Black trans sex worker (Kitana Kiki Rodriguez), as she hunts down her cheating boyfriend across Los Angeles. A vibrant, unapologetic ode to marginalized communities."
      },
      {
        "poster_image_id": 38,
        "title": "The Watermelon Woman, Cheryl Dunye (1996)",
        "content": "Cheryl (played by Cheryl Dunye), a Black lesbian video store clerk in 1990s Philadelphia, uncovers the erased history of Fae Richards, a fictional 1930s Black actress typecast as “mammy” roles. Blurring reality and fiction, the film stitches together fake archival photos, interviews, and a forbidden interracial romance to critique Hollywood’s systemic erasure of Black queer voices."
      },
      {
        "poster_image_id": 52,
        "title": "Joyland, Saim Sadiq (2022)",
        "content": "In Pakistan, a married man joins an erotic theater troupe and falls for a transgender star (Alina Khan), unraveling societal taboos and his own repressed desires."
      },
      {
        "poster_image_id": 44,
        "title": "But I’m a Cheerleader, Jamie Babbit (1999)",
        "content": "Megan (Natasha Lyonne), a cheerleader, is shipped to “True Directions,” a conversion therapy camp, by her suspicious parents. There, she meets Graham (Clea DuVall), a rebellious lesbian, and together they sabotage the camp’s heteronormative programming with drag king performances, subversive therapy sessions, and a love story that’s equal parts absurd and heartfelt."
      },
      {
        "poster_image_id": 77,
        "title": "Pariah, Dee Rees (2011)",
        "content": "A Black teenager (Adepero Oduye) navigates coming out in Brooklyn, balancing her conservative family’s expectations with her burgeoning identity as a butch lesbian."
      },
      {
        "poster_image_id": 54,
        "title": "Moonlight, Barry Jenkins (2016)",
        "content": "A triptych tracing the life of Chiron, a Black gay man in Miami, as he navigates poverty, bullying, and self-discovery across three defining chapters: childhood (\"Little\"), adolescence (\"Chiron\"), and adulthood (\"Black\"). The film juxtaposes the harsh realities of toxic masculinity with moments of tender vulnerability."
      },
      {
        "poster_image_id": 59,
        "title": "Portrait of a Lady on Fire, Céline Sciamma (2019)",
        "content": "In 18th-century France, a painter, Marianne, is hired to secretly portrait Héloïse, a reluctant bride-to-be. As the women collaborate on the painting, their mutual gaze ignites a forbidden love affair."
      }
    ]
  },
  {
    "name": "The Rise of Feminist Horror",
    "slug": "rfh",
    "movies": [
      {
        "poster_image_id": 78,
        "title": "Revenge, Coralie Fargeat (2017)",
        "content": "After a brutal assault in the desert, a young woman is left for dead; but she isn’t finished. In this visceral rape-revenge thriller, Jen uses her indomitable will and transforming inner strength to hunt down her attackers in a bloody, cathartic quest for justice."
      },
      {
        "poster_image_id": 79,
        "title": "The Substance, Coralie Fargeat (2024)",
        "content": "In a world obsessed with youth and perfection, former TV fitness star Elisabeth Sparkle turns to a radical cellular regeneration drug. The treatment promises a rejuvenated appearance but comes with horrifying side effects, turning her transformation into a dark exploration of identity, body modification, and the cruelty of external expectations."
      },
      {
        "poster_image_id": 80,
        "title": "Titane, Julia Ducournau (2021)",
        "content": "A genre-bending body horror thriller, Titane follows a woman marked by a titanium plate who embarks on a violent, surreal journey. The film blurs the lines between human and machine while delving into themes of sexuality, identity, and extreme transformation, challenging audiences with its stark and provocative imagery."
      },
      {
        "poster_image_id": 81,
        "title": "The Final Girls, Todd Strauss-Schulson (2015)",
        "content": "In this meta-horror comedy reimagining, a group of women finds themselves transported into a retro slasher film. Forced to confront the clichés of 1980s horror while grappling with personal loss and shared trauma, they must band together to survive and rewrite the rules of the genre."
      },
      {
        "poster_image_id": 82,
        "title": "Jennifer’s Body, Karyn Kusama (2009)",
        "content": "High school cheerleader Jennifer Check becomes possessed by a demonic force, turning her into a succubus who preys on her male classmates. As her best friend Needy struggles with the fallout, the film marries biting satire with horror to comment on toxic masculinity and the objectification of women."
      },
      {
        "poster_image_id": 83,
        "title": "A Girl Walks Home Alone at Night, Ana Lily Amirpour (2014)",
        "content": "Set in a desolate Iranian ghost town, this stylish vampire western follows a mysterious, solitary vampire. As she stalks the night, her enigmatic presence challenges conventional horror tropes, subverting expectations with a moody, noir-like atmosphere and a fresh take on empowerment."
      },
      {
        "poster_image_id": 84,
        "title": "Raw, Julia Ducournau (2016)",
        "content": "Directed by Julia Ducournau, this French body horror film uses cannibalism as a metaphor for the discovery and unleashing of repressed female sexuality. It challenges the boundaries of transformation, identity, and what it means to be feminine."
      },
      {
        "poster_image_id": 85,
        "title": "Promising Young Woman, Emerald Fennell (2020)",
        "content": "Cassie, scarred by a traumatic past, embarks on a calculated mission to confront and dismantle the culture of sexual predation. This darkly satirical thriller blends revenge with social commentary, as Cassie navigates the complex terrain of modern rape culture with sharp wit and determined resolve."
      }
    ]
  },
  {
    "name": "The Power of Documentary",
    "slug": "tpod",
    "movies": [
      {
        "poster_image_id": 40,
        "title": "All the Beauty and the Bloodshed, Laura Poitras (2022)",
        "content": "This compelling documentary delves into the life of photographer and activist Nan Goldin, intertwining her groundbreaking art with her crusade against the Sackler family's role in the opioid crisis. Through intimate interviews and powerful imagery, the film explores Goldin's personal struggles, her formation of the advocacy group P.A.I.N. (Prescription Addiction Intervention Now), and her impactful protests that led major art institutions to sever ties with the Sacklers. It's a profound examination of art, activism, and the fight for accountability."
      },
      {
        "poster_image_id": 87,
        "title": "Flee, Jonas Poher Rasmussen (2021)",
        "content": "Blending animation and archival footage, this documentary recounts the harrowing journey of a gay Afghan refugee, offering a deeply personal perspective on displacement and identity."
      },
      {
        "poster_image_id": 88,
        "title": "Fire of Love, Sara Dosa (2022)",
        "content": "This visually stunning documentary chronicles the lives of French volcanologists Katia and Maurice Krafft, a couple united by their passion for studying volcanoes. Through mesmerizing archival footage and poetic narration, the film captures their daring explorations of active volcanoes over two decades, highlighting both their scientific contributions and the profound love that fueled their adventures."
      },
      {
        "poster_image_id": 89,
        "title": "The Fire Within: A Requiem for Katia and Maurice Krafft, Werner Herzog (2022) ",
        "content": "Complementing Fire of Love, Herzog's tribute delves into the lives and legacy of the Kraffts, blending their breathtaking footage with his contemplative narration to examine their passion and the sublime power of nature."
      },
      {
        "poster_image_id": 90,
        "title": "20 Days in Mariupol, Mstyslav Chernov (2023)",
        "content": "This harrowing documentary captures the early days of Russia's siege of Mariupol through the lens of Associated Press journalists. It offers an unflinching look at the horrors of war, highlighting the resilience of both civilians and journalists under fire."
      },
      {
        "poster_image_id": 91,
        "title": "Little Girl Blue, Mona Achache (2023)",
        "content": "A biographical docudrama where director Mona Achache explores her mother's life, with Marion Cotillard portraying Carole Achache. The film delves into personal archives to uncover a story of creativity and resilience."
      },
      {
        "poster_image_id": 92,
        "title": "Four Daughters, Kaouther Ben Hania (2023)",
        "content": "Blending documentary and reenactment, this film explores the story of a Tunisian mother whose daughters joined ISIS. It examines the complexities of family, radicalization, and the societal forces at play."
      },
      {
        "poster_image_id": 93,
        "title": "Soundtrack to a Coup d’État, Johan Grimonprez (2024)",
        "content": "An innovative blend of archival footage and jazz music, this film explores the 1960 assassination of Congolese leader Patrice Lumumba. It delves into the geopolitical machinations of the Cold War era, offering a fresh perspective on a pivotal moment in African history. ​"
      }
    ]
  },
  {
    "name": "Cinema Against Capitalism",
    "slug": "cac",
    "movies": [
      {
        "poster_image_id": 94,
        "title": "Parasite, Bong Joon-ho (2019)",
        "content": "A masterful social thriller that exposes the chasm between rich and poor in modern Seoul. The film's dark humor and suspenseful narrative highlight the systemic inequalities perpetuated by capitalism."
      },
      {
        "poster_image_id": 95,
        "title": "The Menu, Mark Mylod (2022)",
        "content": "A culinary satire that skewers elitism and the commodification of art, as a group of wealthy diners experience a night of unexpected revelations."
      },
      {
        "poster_image_id": 96,
        "title": "The Assembly Line, Mathias Gokalp (2023)",
        "content": "Set in France shortly after May 1968, this film follows Robert, an academic and far-left activist, who takes a job as a line worker at a car factory. Alongside fellow comrades, he aims to infiltrate the factory to reignite revolutionary fervor. However, most workers are disinterested in politics. When the company demands additional unpaid hours, Robert and a few others see an opportunity to spark a social movement.​"
      },
      {
        "poster_image_id": 97,
        "title": "They Live, John Carpenter (1988)",
        "content": "A cult classic where a drifter discovers that the ruling class are aliens manipulating humans through subliminal messages, serving as a metaphor for capitalist control and consumerism."
      },
      {
        "poster_image_id": 98,
        "title": "Modern Times, Charlie Chaplin (1936)",
        "content": "A silent film that humorously yet poignantly critiques the dehumanizing aspects of industrial capitalism."
      },
      {
        "poster_image_id": 99,
        "title": "Full Time, Éric Gravel (2021)",
        "content": "This intense drama centers on Julie, a single mother of two, who commutes from her rural home to her job as a chambermaid in a Parisian luxury hotel. Amidst nationwide transport strikes, Julie's already challenging life becomes a race against time as she juggles her responsibilities, aiming to secure a better future for her family.​"
      },
      {
        "poster_image_id": 61,
        "title": "Princess Mononoke, Hayao Miyazaki (1997)",
        "content": "An epic tale where industrialization clashes with nature, reflecting on the environmental costs of capitalist expansion."
      },
      {
        "poster_image_id": 101,
        "title": "Mickey 17, Bong Joon-ho (2025)",
        "content": "Set in a dystopian future, this sci-fi narrative explores themes of disposability and corporate dominance through the story of a cloned worker on a colonized planet."
      },
      {
        "poster_image_id": 102,
        "title": "La Chinoise, Jean-Luc Godard (1967)",
        "content": "In this politically charged film, five university students in Paris, led by Veronique and Guillaume, immerse themselves in Maoist ideology during their summer break. Living together in an apartment borrowed from a friend's wealthy parents, they engage in fervent discussions about applying revolutionary principles to their lives, reflecting the era's political turbulence"
      }
    ]
  },
  {
    "name": "Rebel Women",
    "slug": "rw",
    "movies": [
      {
        "poster_image_id": 103,
        "title": "Suffragette, Sarah Gavron (2015)",
        "content": "Set in early 20th-century Britain, this historical drama follows working-class women who join the suffragette movement, risking everything to fight for their right to vote."
      },
      {
        "poster_image_id": 104,
        "title": "Moxie, Amy Poehler (2021)",
        "content": "A contemporary teen comedy-drama where a shy 16-year-old publishes an anonymous zine to expose sexism at her high school, sparking a feminist revolution among her peers."
      },
      {
        "poster_image_id": 105,
        "title": "The Girl with the Dragon Tattoo, David Fincher (2011)",
        "content": "Lisbeth Salander, a brilliant hacker with a traumatic past, partners with a journalist to solve a decades-old mystery, confronting powerful adversaries and seeking justice on her own terms."
      },
      {
        "poster_image_id": 106,
        "title": "Rebel Dykes, Siân A. Williams & Harri Shanahan (2021)",
        "content": "This documentary delves into the underground lesbian scene in 1980s and 1990s London, highlighting the lives of a group of women who defied societal norms through activism, art, and community building. It showcases their involvement in protests, music, and the fight against homophobia. ​"
      },
      {
        "poster_image_id": 107,
        "title": "Women Talking, Sarah Polley (2022)",
        "content": "Based on Miriam Toews' novel, this powerful drama centers on a group of Mennonite women who, after enduring systemic sexual abuse within their isolated community, convene to decide their collective response. The film delves into themes of faith, autonomy, and resistance, highlighting the women's struggle to reconcile their beliefs with the need for justice."
      },
      {
        "poster_image_id": 108,
        "title": "Vagabond, Agnès Varda (1985)",
        "content": "Vagabond follows Mona, a young woman who abandons her conventional life in Paris to wander the French countryside. Through a series of flashbacks, we learn of her encounters with various individuals. Mona's quest for autonomy and rejection of societal norms lead her to a tragic end, highlighting the harsh realities faced by women who defy traditional roles.​"
      },
      {
        "poster_image_id": 109,
        "title": "Little Women, Greta Gerwig (2019)",
        "content": "This adaptation of Louisa May Alcott's classic novel follows the lives of the four March sisters in 19th century Massachusetts. With their father away serving in the Civil War, the sisters and their mother, Marmee, navigate personal aspirations, societal expectations, and familial bonds."
      },
      {
        "poster_image_id": 110,
        "title": "Hidden Figures, Theodore Melfi (2016)",
        "content": "This movie tells the true story of three African-American women, Katherine Johnson, Dorothy Vaughan, and Mary Jackson, who worked at NASA during the early years of the U.S. space program. Facing racial and gender discrimination, they made significant contributions to the success of astronaut John Glenn's orbital flight. "
      }
    ]
  },
  {
    "name": "Black Voices in Cinema",
    "slug": "bvc",
    "movies": [
      {
        "poster_image_id": 111,
        "title": "American Fiction, Cord Jefferson (2023)",
        "content": "A satirical comedy that critiques the publishing industry's exploitation of Black narratives, following a writer's journey to reclaim his voice and identity.​"
      },
      {
        "poster_image_id": 112,
        "title": "Do the Right Thing, Spike Lee (1989)",
        "content": "Set in a Brooklyn neighborhood, this provocative drama explores racial tensions and social injustice, culminating in a powerful examination of community dynamics and systemic oppression."
      },
      {
        "poster_image_id": 113,
        "title": "Malcolm X, Spike Lee (1992)",
        "content": "A biographical epic that chronicles the life of the civil rights leader, delving into his transformation and the complexities of his philosophy and activism."
      },
      {
        "poster_image_id": 114,
        "title": "The Fire Inside, Rachel Morrison (2024)",
        "content": "This inspiring sports drama tells the true story of Claressa Shields, the greatest female boxer of all time, highlighting her journey to overcome adversity and achieve greatness. ​"
      },
      {
        "poster_image_id": 115,
        "title": "Rustin, George C. Wolfe (2023)",
        "content": "A biographical drama that chronicles the life of Bayard Rustin, the openly gay civil rights activist who organized the 1963 March on Washington, highlighting his contributions to the movement and the challenges he faced."
      },
      {
        "poster_image_id": 116,
        "title": "Hard Truths, Mike Leigh (2024)",
        "content": "This movie follows Pansy, a Caribbean-British woman grappling with depression and strained familial relationships. Set in London, the film delves into the complexities of mental health, grief, and the enduring bonds of family."
      },
      {
        "poster_image_id": 117,
        "title": "The Color Purple, Steven Spielberg (1985)",
        "content": "Based on Alice Walker's Pulitzer Prize-winning novel, this film follows the life of Celie, an African American woman in the early 20th century American South, as she overcomes oppression and finds her voice."
      },
      {
        "poster_image_id": 118,
        "title": "The Best Man, Malcolm D. Lee (1999)",
        "content": "A romantic comedy that delves into the lives of a group of college friends reuniting for a wedding, uncovering secrets and testing friendships, all while celebrating Black love and camaraderie."
      }
    ]
  }
]