[
    {
        "name": "Barbara Hammer",
        "photo_id": 32,
        "content": [
            "Barbara Hammer was an American experimental filmmaker, artist, activist, and pioneer of queer cinema, born in 1939 in Hollywood. Over her five-decade career, she made 80 movies and videos that explored queer identity, feminism, and the body as a site of political and personal expression.",
            {
                "image_id": 34,
                "caption": ""
            },
            "In the early 1970s, Barbara Hammer immersed herself in film studies at San Francisco State University. Watching Meshes of the afternoon was a turning point; it sparked her desire to turn the camera on and explore her own life through film.",
            "She became deeply involved in the feminist and gay liberation movements, which profoundly influenced her artistic vision. Rejecting conventional storytelling, she embraced experimental techniques to depict lesbian desire.<br>Hammer’s early work, such as Dyketactics (1974), Superdyke (1975) and Women I Love (1976) were among the first films to unapologetically center lesbian eroticism and relationships. These movies celebrated female pleasure and intimacy while defying censorship and heteronormative expectations.",
            {
                "image_id": 119,
                "caption": "Dyketactics (1974)"
            },
            "Her 1992 documentary Nitrate Kisses expanded her focus to marginalized people, intertwining gay and lesbian archival footage with personal narratives. The film confronts the erasure of LGBTQ+ lives from mainstream narratives by weaving together fragments of desire, memory and resistance. Shot on nitrate film stock, a medium known for its fragility, Hammer uses the material itself as a metaphor for the precariousness of queer histories. Just as nitrate film decays nor combusts if improperly preserved, so too have queer stories been suppressed, censored, or lost to time.",
            {
                "image_id": 120,
                "caption": "Nitrate Kisses (1992)"
            },
            "Even after being diagnosed with ovarian cancer in 2006, she continued creating, producing works like A Horse is Not a Metaphor (2008), which reflected on illness and mortality with her signature poetic defiance.",
            "Barbara Hammer’s fearless artistry and unwavering activism opened doors for generations of queer filmmakers. Through her films, she not only documented lesbian lives but also redefined what cinema could be; a space for radical love, memory and resistance. Her work remains essential viewing, a testament to the power of lesbian storytelling and the enduring fight for representation.",
            {
                "image_id": 121,
                "caption": "Vital Signs (1991)"
            }
        ]
    },
    {
        "name": "Chantal Akerman",
        "photo_id": 31,
        "content": [
            "Chantal Akerman was a Belgian filmmaker, artist, and writer, born in Brussels in 1950 and passing away in Paris in 2015. She is widely considered one of the most important and innovative figures in the history of cinema. Her work blends formal experimentation with deep personal insight, often exploring themes like identity, trauma, memory, and the rhythms of everyday life.",
            {
                "image_id": 122,
                "caption": ""
            },
            "Akerman was the daughter of Polish Jewish immigrants, and her mother was a Holocaust survivor; a fact that had a profound and lasting impact on her. The trauma of her family history and the silence surrounding it became central undercurrents in her work. Movies like News from Home (1977), Là-bas (2006), and No Home Movie (2015) reflect on exile, memory, and the weight of absence. In No Home Movie, she intimately films her mother during the last months of her life, in what became Akerman’s final work as well.",
            {
                "image_id": 123,
                "caption": "News from Home (1977)"
            },
            "Her breakthrough came with Jeanne Dielman, 23, quai du Commerce, 1080 Bruxelles (1975), made when she was only 25. This three-hour minimalist portrait of a widowed housewife gradually reveals the psychic toll of domestic labor, patriarchy, and repression. It was a landmark in feminist filmmaking, praised for its radical form and political power, and is now considered one of the greatest films ever made.",
            "Chantal Akerman was also openly lesbian, and while she didn’t always place sexuality at the center of her narratives, queerness is a vital part of her artistic identity. One of her earliest and boldest works, Je, tu, il, elle (1974), is a striking example. In the movie, Akerman not only directs but also plays the main character : a solitary young woman navigating isolation, routine, and desire. The film culminates in an extended, intimate sex scene between two women, depicted with a raw, unfiltered honesty that was groundbreaking at the time. There is no sensationalism, just the quiet, deliberate observation of a body in relation to another, of yearning, tension, and vulnerability. Je, tu, il, elle broke taboos, both in form and in subject matter, and asserted lesbian desire on screen in a way that was rarely seen in cinema then, or even now. Her queerness was not performative or loud, but lived; infused in her characters, her framing, her silences.",
            {
                "image_id": 124,
                "caption": "Je, tu, il, elle (1974)"
            },
            "Throughout her career, Akerman moved between fiction, documentary, installation art, and writing. Some of her other major works include Les Rendez-vous d’Anna (1978), Golden Eighties (1986), Histoires d’Amérique (1989), and Sud (1999), a chilling road-movie documentary about a lynching in the American South. Whether she was working with narrative or documentary material, Akerman remained fiercely independent, unafraid to challenge cinematic conventions or viewer expectations.",
            "Her influence is vast; not only in feminist and queer cinema, but also in slow cinema, contemporary art, and documentary practice. Akerman’s work reminds us that what’s private can be political, and that the seemingly mundane can hold deep emotional and historical weight."
        ]
    },
    {
        "name": "Jocelyne Saab",
        "photo_id": 33,
        "content": [
            "Jocelyne Saab was a pioneering Lebanese filmmaker, journalist, and artist whose work continues to resonate for its intimate exploration of identity, memory, and the devastation of war. Born in Beirut in 1948, Saab began her career as a war correspondent during the Lebanese Civil War, reporting for French television. But the camera soon became more than a tool for documentation; it became a means of resistance and personal expression. Her shift from journalism to filmmaking marked the beginning of a powerful body of work that blended the political with the poetic, often focusing on the lives of those marginalized by conflict and displacement.",
            {
                "image_id": 125,
                "caption": ""
            },
            "Her early documentaries, such as Lebanon in a Whirlwind (1975) and Beirut, Never Again (1976), reflect her raw, direct response to the war ravaging her home country. These films are not detached reports but deeply personal acts of witnessing, capturing the psychological toll of war on civilians. As her style evolved, Saab pushed the boundaries between documentary and fiction, notably in Once Upon a Time: Beirut (1994), a hybrid film that explores the fragmented memory of a city through the eyes of two young women. The film weaves archival footage, fiction, and reflective voiceover to question how history is told, and by whom.",
            {
                "image_id": 126,
                "caption": "South Lebanon: The Story of a Village Under Siege (1976)"
            },
            "Another of her most celebrated works is Sahara Is Not for Sale (1977), a rare portrait of the Western Sahara conflict and nomadic life, which underlines her commitment to giving voice to forgotten or silenced stories beyond Lebanon. Saab’s cinema consistently centers the experience of women, especially in the face of exile and cultural loss.",
            {
                "image_id": 127,
                "caption": "Sahara is not for Sale (1977)"
            },
            "In Dunia (2005), her only feature-length fiction film, she explores female desire, censorship, and liberation in contemporary Egypt, blending dance, poetry, and politics into a bold feminist narrative.",
            "Jocelyne Saab’s films defy simple categorization. At once political and lyrical, rooted in documentary yet open to experimentation, her work maps a deeply personal and transnational vision of the Arab world. She passed away in 2019, leaving behind a vital and courageous filmography that challenges dominant narratives and insists on the power of cinema to remember, resist, and dream."
        ]
    },
    {
        "name": "Luca Guadagnino",
        "photo_id": 128,
        "content": [
            "Luca Guadagnino is an Italian director, screenwriter, and producer. Born in Palermo in 1971 and raised partly in Ethiopia, his multicultural upbringing is reflected in the way he approaches identity, culture, and desire in his films. He studied film history at La Sapienza University in Rome and began making short films before moving into feature-length cinema.",
            {
                "image_id": 129,
                "caption": ""
            },
            "His films often explore themes of desire, identity, transformation, and emotional repression. Many of his characters undergo personal awakenings or confrontations with their inner selves. Relationships (especially romantic or forbidden ones) are central to his storytelling. Guadagnino is also known for his interest in the fluidity of sexuality and gender, as seen most clearly in Call Me by Your Name (2017).",
            {
                "image_id": 130,
                "caption": "Call Me by Your Name (2017)"
            },
            "Among his most famous films are I Am Love (2009), A Bigger Splash (2015), Call Me by Your Name (2017), Suspiria(2018), and Bones and All (2022). Each of these films showcases his interest in beauty, emotion, and complex human relationships. Call Me by Your Name, in particular, brought him international acclaim and multiple award nominations, including an Oscar nomination for Best Picture.",
            {
                "image_id": 131,
                "caption": "Suspiria (2018)"
            },
            "Guadagnino frequently works with a close group of collaborators, including actors like Tilda Swinton and Timothée Chalamet, and composers like Ryuichi Sakamoto, Thom Yorke, and Sufjan Stevens. His influences include Italian filmmakers like Bernardo Bertolucci and Luchino Visconti, as well as French and American cinema from the 1960s and 70s.",
            "More recently, Guadagnino directed Bones and All, a film that mixes romance and horror, and Challengers (2024), a love triangle set in the world of professional tennis. His work continues to evolve, but his focus on emotion, atmosphere, and personal identity remains central. Guadagnino is widely regarded as one of the most distinctive and important voices in contemporary international cinema."
        ]
    }
]