[
  {
    "poster_image_id": 35,
    "title": "Dyketactics",
    "year": 1974,
    "director": "Barbara Hammer",
    "review_by": "Vickie",
    "content": "Sunlight. Skin. Armpit hair as radical as a raised fist. Hammer's 4 minute 16mm love letter shows lesbian desire with unapologetic joy. No men, no apologies — just bodies moving through golden grass, electric with freedom. The male gaze never stood a chance."
  },
  {
    "poster_image_id": 36,
    "title": "Dykes, Camera, Action!",
    "year": 2018,
    "director": "Caroline Berler",
    "review_by": "Vickie",
    "content": "Caroline Berler’s documentary is like the Avengers Endgame of queer cinema, except instead of Thanos, the villain is heterosexuality. This 61 minute love letter to lesbian filmmakers is part film school, part therapy session. Spoiler: Everything is gay if you’re brave enough."
  },
  {
    "poster_image_id": 38,
    "title": "The Watermelon Woman",
    "year": 1996,
    "director": "Cheryl Dunye",
    "review_by": "Vickie",
    "content": "A groundbreaking faux-documentary, part rom-com, part middle finger to archival erasure, Cheryl Dunye’s debut feature follows her fictionalized self — a Black lesbian video store employee — on a quest to resurrect the erased legacy of Fae Richards, a fictional 1930s Black actress typecast in racist “mammy” roles. The Watermelon Woman is less a movie and more a manifesto in denim overalls. It’s messy, hilarious, and so ahead of its time, it’s basically yelling at us from the future."
  },
  {
    "poster_image_id": 37,
    "title": "Desert Hearts",
    "year": 1985,
    "director": "Donna Deitch",
    "review_by": "Vickie",
    "content": "Set in 1959 Reno, this groundbreaking lesbian gem follows Vivian (Helen Shaver), a guarded professor divorcing her husband, and Cay (Patricia Charbonneau), the free-spirited artist who awakens her desires. Donna Deitch crafts a quiet revolution, ditching clichés for raw intimacy; see the iconic hotel scene, shot in tender silence. Deitch risked it all (selling her house, rallying queer investors) to make this during Reagan-era homophobia. Critics called it radical; audiences called it life-changing. Its legacy burns bright : a defiantly joyful ode to love’s power."
  },
  {
    "poster_image_id": 39,
    "title": "Three Generations (About Ray)",
    "year": 2015,
    "director": "Gaby Dellal",
    "review_by": "Sorenn",
    "content": "About Ray, directed by Gaby Dellal, tells the story of a transgender teen, Ray (played by Elle Fanning), who is transitioning from female to male and navigating complex family dynamics. The film focuses not just on Ray’s journey, but also on how his mother (Naomi Watts) and grandmother (Susan Sarandon) react and adapt.<br><br>While the film aims to explore identity and acceptance, its message is sometimes weakened by a lack of depth and uneven pacing. However, Elle Fanning delivers a sincere and sensitive performance, and the cast overall brings warmth to the story.<br><br>Though not perfect, About Ray is a heartfelt attempt to portray a family adjusting to change, with moments of honesty and emotion."
  },
  {
    "poster_image_id": 40,
    "title": "All the Beauty and the Bloodshed",
    "year": 2022,
    "director": "Laura Poitras",
    "review_by": "Vickie",
    "content": "Laura Poitras’ Oscar-nominated documentary All the Beauty and the Bloodshed is a riveting fusion of art, activism, and personal reckoning. Centering on photographer Nan Goldin, the film interweaves her groundbreaking work, like the raw, intimate Ballad of Sexual Dependency slideshows, with her crusade against the Sackler family, whose opioid empire fueled a public health crisis. Goldin’s journey is framed by trauma: her sister’s institutionalization and suicide, her own OxyContin addiction, and the AIDS-era losses of friends like Cookie Mueller. These experiences galvanize her to co-found P.A.I.N. (Prescription Addiction Intervention Now), staging protests at Sackler's museums like the Met and Guggenheim, ultimately pressuring institutions to strip the family’s name. Poitras deftly connects Goldin’s art, unflinching portraits of queer and marginalized communities to her activism, revealing both as acts of resistance against systemic oppression. While the dual narrative occasionally strains cohesion, the film’s power lies in its unvarnished honesty, blending archival footage, candid interviews, and the haunting grace of Goldin’s voiceover. A triumph of radical storytelling."
  },
  {
    "poster_image_id": 41,
    "title": "Arcane",
    "year": "2021-2024",
    "director": "Christian Linke, Alex Yee",
    "review_by": "Sorenn",
    "content": "A huge success from Fortiche Studio, French animation is asserting itself with the series Arcane, an adaptation of characters from the League of Legends video game. It’s an exciting story that immerses us in a finely crafted universe, where the animation has been pushed towards a new form, a perfect blend of 2D and 3D, almost like animated paintings.<br><br>The characters are all well-developed. They each bring something to the narrative and vary greatly in terms of representation: there are characters of all body types, sizes, and backgrounds. One notable example is the romance between Caitlyn and Vi, two openly lesbian women whose relationship develops throughout the story."
  },
  {
    "poster_image_id": 42,
    "title": "Blue Jean",
    "year": 2022,
    "director": "Georgia Oakley",
    "review_by": "Vickie",
    "content": "Jean is a closeted gym teacher in 1988, in England, living a double life like a secret agent, except her mission is avoiding any hint of gayness to keep her job. Her girlfriend Viv is out and proud, but Jean’s idea of rebellion is hiding her Blind Date obsession and bleaching her hair in a panic. Blue Jean is both a time capsule and a battle cry. Jean’s journey from fear to fragile hope will leave you breathless; and furious at how little has changed."
  },
  {
    "poster_image_id": 43,
    "title": "Bound",
    "year": 1996,
    "director": "Lana Wachowski, Lilly Wachowski",
    "review_by": "Vickie",
    "content": "Set in a claustrophobic Chicago apartment complex, the story follows Corky and Violet, a butch-femme duo, plotting to steal mob money and escape patriarchal violence. Unlike traditional noir’s doomed \"femmes fatales\", Corky and Violet are architects of their own liberation. The Wachowskis frame their relationship with sincerity, avoiding the male gaze that plagued 90s erotic thrillers like Basic Instinct. Their chemistry isn’t just steamy, it’s revolutionary, portraying lesbian love as both tender and tactical."
  },
  {
    "poster_image_id": 44,
    "title": "But I’m a Cheerleader",
    "year": 1999,
    "director": "Jamie Babbit",
    "review_by": "Vickie",
    "content": "Jamie Babbit’s cult classic turns the horrors of conversion therapy into a satirical carnival of self-discovery. Natasha Lyonne stars as Megan, an all-American cheerleader whose love for Melissa Etheridge and tofu lands her at True Directions, a conversion camp run by Cathy Moriarty’s and RuPaul (out of drag) as the clueless “ex-gay” counselor Mike. There, Megan falls for Clea DuVall’s rebellious Graham, sparking a romance that dismantles the camp’s absurd gender binaries."
  },
  {
    "poster_image_id": 45,
    "title": "Close",
    "year": 2022,
    "director": "Lukas Dhont",
    "review_by": "Vickie",
    "content": "Two 13 year old BFFs, Léo and Rémi, are living their best life : running through flower fields, having sleepovers, and cuddling like golden retrievers. But then society shows up : Léo starts bench-pressing masculinity to prove he’s not that kind of friend, while Rémi just wants to play the oboe and hug. I can tell you, it ends with more tears than after listening to an Olivia Rodrigo breakup album. It's a gorgeously brutal film about love society refuses to name. You’ll leave haunted and furious at the world’s cruelty."
  },
  {
    "poster_image_id": 46,
    "title": "Disenchantment",
    "year": "2018-2023",
    "director": "Matt Groening",
    "review_by": "Sorenn",
    "content": "Disenchantment, created by Matt Groening (The Simpsons, Futurama), is an animated fantasy comedy set in the medieval kingdom of Dreamland. It follows Bean, a rebellious princess, along with her elf friend Elfo and personal demon Luci.<br><br>The show blends Groening's signature humor with darker, serialized storytelling. While the first seasons were uneven, the series grows deeper and more ambitious over time. Visually charming and often clever, it balances satire, adventure, and emotional arcs."
  },
  {
    "poster_image_id": 47,
    "title": "Get Out",
    "year": 2017,
    "director": "Jordan Peele",
    "review_by": "Vickie",
    "content": "Jordan Peele’s Get Out redefines horror as a scalpel for dissecting racism, following Chris (Daniel Kaluuya), a Black man lured to his white girlfriend’s family estate where faux-liberal hospitality masks a grotesque plot to commodify Black bodies. Through chilling satire and visceral tension, microaggressions curdling into abduction, hypnotic “sunken place” metaphors for systemic erasure, and a climax where cotton stuffing becomes a weaponized nod to slavery, Peele exposes the insidiousness of “nice racism.” Kaluuya’s Oscar-nominated performance oscillates between vulnerability and defiance. Balancing dark humor and body horror, it’s a cultural lightning rod that won Best Original Screenplay, and cemented the “sunken place” as shorthand for Black marginalization. A masterpiece where every scream is political and every frame a rebellion."
  },
  {
    "poster_image_id": 48,
    "title": "Happening",
    "year": 2021,
    "director": "Audrey Diwan",
    "review_by": "Vickie",
    "content": "Audrey Diwan’s movie is a visceral, unflinching adaptation of Annie Ernaux’s memoir about her illegal abortion in 1963 in France. Anchored by Anamaria Vartolomei’s raw performance, the film blends personal anguish with broader societal critic, resonating powerfully in today’s post-Roe v. Wade climate. It's a gut-punch of a film that turns a woman’s body into a political warzone. Diwan’s direction is as precise as a scalpel; cutting deep and leaving scars."
  },
  {
    "poster_image_id": 49,
    "title": "Hazbin Hotel",
    "year": 2019,
    "director": "Vivienne Medrano",
    "review_by": "Sorenn",
    "content": "Hazbin Hotel, created by Vivienne Medrano, is a bold and visually explosive adult animated musical set in Hell. The story follows Charlie, the princess of Hell, as she opens a hotel to rehabilitate demons and offer them a shot at redemption.<br><br>With its unique animation style, catchy songs, and dark humor, the show stands out for its creativity and energy. While the tone may not be for everyone, its strong characters, witty writing, and emotional moments give it real heart."
  },
  {
    "poster_image_id": 50,
    "title": "The Incredibles 2",
    "year": 2018,
    "director": "Brad Bird",
    "review_by": "Sorenn",
    "content": "The Incredibles 2 takes a refreshing feminist turn by flipping traditional gender roles. The film centers around Elastigirl (Helen Parr), who takes on the lead superhero role, while Mr. Incredible (Bob Parr) stays at home to care for their children. This dynamic challenges the conventional family structure and showcases the empowerment of women in both the workplace and at home.<br><br>Elastigirl is portrayed as not just a supportive character but a fully capable, strong hero in her own right. Her mission highlights her leadership, problem-solving, and resilience, emphasizing that women can be multifaceted — balancing career success with family responsibilities."
  },
  {
    "poster_image_id": 51,
    "title": "Je, tu, il, elle",
    "year": 1974,
    "director": "Chantal Akerman",
    "review_by": "Vickie",
    "content": "She ate sugar straight from the bag. Then she fucked her ex. The end.<br>Akerman’s raw, stripped-down triptych isn’t a film : it’s an exorcism. There are three acts of radical boredom and sudden violence :<br><br>JE : A woman (Akerman) paces a bare room, rearranges furniture, writes letters she’ll never send, and devours an entire bag of powdered sugar like it’s communion.<br>IL : She hitchhikes, listens to a truck driver monologue about his sex life while staring dead-eyed into the camera, and... that’s it.<br>ELLE : She visits a woman. They fuck. Not sexy-fuck. Real-fuck. Awkward, intense, then she leaves.<br><br>Akerman weaponizes duration like no one else. That sugar scene? You'll feel diabetic by the end. The sex ? Raw, fumbling, devoid of eroticism,  just desperate bodies communicating what words can't."
  },
  {
    "poster_image_id": 52,
    "title": "Joyland",
    "year": 2022,
    "director": "Saim Sadiq",
    "review_by": "Vickie",
    "content": "Meet Haider, a guy so unemployed he’s practically part of the furniture, until he lands a very secretive job as a backup dancer for Biba, a transgender woman and performer. Cue the chaos : Haider lies to his family about managing a theater while practicing hip thrusts in the mirror. His wife Mumtaz, forced to quit her job as a makeup artist, channels her rage into staring daggers at everyone. The film criticizes traditional family structures through Haider’s father, a patriarch clinging to outdated ideals. Haider’s relationship with Biba challenges Pakistan’s rigid gender norms, portraying queer desire with rare tenderness. Their chemistry subverts stereotypes, showing how Biba navigates male gaze and survival. Joyland doesn’t just break barriers, it dances on them."
  },
  {
    "poster_image_id": 53,
    "title": "Kneecap",
    "year": 2024,
    "director": "Rich Peppiatt",
    "review_by": "Vickie",
    "content": "A loud scream, semi-fictionalized adventure about the incendiary Irish rap trio Kneecap, blending anarchic humor, IRA graffiti, and Irish-language hip-hop into a middle finger to politics. Think Trainspotting meets 8 Mile, but with more Gaelic slang and molotov cocktails."
  },
  {
    "poster_image_id": 54,
    "title": "Moonlight",
    "year": 2016,
    "director": "Barry Jenkins",
    "review_by": "Vickie",
    "content": "Barry Jenkins’ movie is a groundbreaking exploration of Black queer masculinity, structured as a triptych tracing Chiron’s life from childhood to adulthood in Miami. The film’s three acts capture his evolution from a bullied boy to a hardened adult. Each actor embodies Chiron’s silent vulnerability, and his sexuality is conveyed through glances, not monologues. His tender beach encounter with Kevin is a rare moment of intimacy in a world hostile to his identity. Moonlight is a haunting, lyrical triumph that turns personal pain into universal poetry. "
  },
  {
    "poster_image_id": 55,
    "title": "Mustang",
    "year": 2015,
    "director": "Deniz Gamze Ergüven",
    "review_by": "Vickie",
    "content": "Deniz Gamze Ergüven’s Mustang follows five sisters in rural Turkey whose lives are upended when conservative villagers imprison them at home after a harmless beach outing sparks accusations of immorality. Confined and groomed for arranged marriages, the girls, led by youngest sister Lale (Güneş Şensoy), rebel through clandestine acts of defiance : sneaking to soccer matches, plotting escapes, and clinging to their fraying autonomy. Ergüven contrasts sunlit moments of fleeting freedom with claustrophobic interiors, weaving a visceral critique of patriarchal control. The title Mustang mirrors their untamed resilience as they navigate invasive virginity tests, abusive guardians, and societal complicity. Nominated for an Oscar and hailed globally as a feminist anthem, the film balances lyrical beauty and raw urgency, culminating in a bittersweet escape that underscores the cost and NECESSITY of resistance. A haunting ode to sisterhood and the unbreakable will to be free."
  },
  {
    "poster_image_id": 56,
    "title": "Nimona",
    "year": 2023,
    "director": "Troy Quane, Nick Bruno",
    "review_by": "Sorenn",
    "content": "A knight is accused of a crime he didn’t commit, and the only person who can help him prove his innocence is Nimona, a shape-shifting teenager who might also be a monster he swore to kill.<br><br>This new Netflix animated film for young audiences, beyond the fact that the knight is gay and his existence as a queer person isn't really questioned (thank you!), features another main character, Nimona, who smartly represents genderfluid individuals. Her shape-shifting powers and the issues she faces (difficulty identifying herself, desire to be everything at once) can be parallel to the struggles faced by trans people, particularly genderfluid individuals. Represented in an original and fantastical way, it is made accessible to all, especially younger audiences, who may feel marginal and just as rock ‘n’ roll as Nimona.<br><br>The animation is unique and stands out from the big studio films (Disney and the like), and it deserves just as much success."
  },
  {
    "poster_image_id": 57,
    "title": "No Other Land",
    "year": 2024,
    "director": "Rachel Szor, Hamdan Ballal, Yuval Abraham, Basel Adra",
    "review_by": "Vickie",
    "content": "No Other Land is not just a documentary, it’s a moral imperative. By collapsing the distance between viewer and victim, it forces reckoning with occupation’s human cost. The film’s power lies in its refusal to offer false hope : families rebuild homes knowing they’ll be destroyed again; Basel films knowing it might not save his community. Yet in bearing witness, the directors forge a defiant act of solidarity. It's a testament to art as resistance."
  },
  {
    "poster_image_id": 58,
    "title": "Paris is Burning",
    "year": 1990,
    "director": "Jennie Livingston",
    "review_by": "Vickie",
    "content": "Jennie Livingston’s Paris Is Burning is a lifeline to a marginalized world. Chronicling 1980s New York’s Black and Latinx ballroom scene, the film captures a community forging family through “Houses” when biological families and society rejected them. The balls were sanctuaries where queer youth could embody unattainable ideals. Yet these performances underscored harsh realities : many participants faced homelessness, sex work, and violence. Venus Xtravaganza, a trans woman featured in the film, was murdered during production. The film introduced terms like shade, reading, and voguing into mainstream lexicon, later popularized by Madonna and RuPaul’s Drag Race. But the director, Livingston, a white queer woman, faced criticism for profiting off Black and Latinx stories without adequately compensating them. Some cast members later sued her, feeling exploited. The debate over who gets to tell marginalized stories remains urgent today. Also, many featured icons (Willi Ninja, Dorian Corey, Pepper LaBeija) died young due to AIDS or violence, their legacies preserved only through the film. Their absence underscores the urgency of documenting queer histories."
  },
  {
    "poster_image_id": 59,
    "title": "Portrait of a Lady on Fire",
    "year": 2019,
    "director": "Céline Sciamma",
    "review_by": "Vickie",
    "content": "Héloïse (Adèle Haenel) is a runaway bride-in-waiting who’d rather yeet herself off a cliff than marry some Italian dude. Marianne (Noémie Merlant) is the artist hired to paint her portrait, but ends up sketching heart eyes instead. Their romance is a slow burn so glacial you’ll forget they’re not actually ice sculptures. Héloïse and Marianne’s affair is bittersweet but empowering, culminating in a finale where Vivaldi’s Summer becomes a haunting anthem of memory. Sciamma’s film is a canvas where every frame burns with beauty, longing, and the quiet power of women who refuse to be erased."
  },
  {
    "poster_image_id": 60,
    "title": "Pride",
    "year": "2014",
    "director": "Matthew Warchus",
    "review_by": "Sorenn",
    "content": "Pride is a powerful and heartwarming British film based on the true story of LGBTQ+ activists who supported striking miners in 1984. Directed by Matthew Warchus, it shows how two very different communities come together through solidarity and shared struggles.<br><br>The film balances humor and emotion beautifully, with standout performances from Ben Schnetzer, Imelda Staunton, and Dominic West. Its message of unity, courage, and compassion feels both timely and timeless.<br><br>Funny, moving, and inspiring — Pride is a must-see film that celebrates the strength of unlikely friendships."
  },
  {
    "poster_image_id": 61,
    "title": "Princess Mononoke",
    "year": 2000,
    "director": "Miyazaki",
    "review_by": "Vickie",
    "content": "Princess Mononoke can be seen as a powerful feminist tale, as it challenges traditional gender roles and highlights the strength and agency of its female characters. The film features two complex female leads: San, the fierce wolf-girl warrior, and Lady Eboshi, the determined leader of Iron Town. Both women are portrayed as strong, independent, and unapologetically assertive in their quests for survival and transformation of their respective worlds.<br><br>San is not a passive character but a fierce protector of nature, while Lady Eboshi represents a more pragmatic, yet equally powerful, force of change. Their struggles emphasize themes of autonomy, empowerment, and the ways women fight against both societal constraints and natural forces."
  },
  {
    "poster_image_id": 63,
    "title": "Queer",
    "year": 2025,
    "director": "Luca Guadagnino",
    "review_by": "Sorenn",
    "content": "After the success of Challenger and Call Me by Your Name, Luca Guadagnino returns to the big screen with Queer, a film that truly lives up to its name.<br><br>Blending fantasy and horror, the film only becomes interesting in its second part, with the first part setting up the plot: William Lee, an American expatriate in Mexico in the 1950s, no longer in his prime, feels lonely. His remedy? Drugs, alcohol, and desperate flirting with the young men in the neighborhood. But this sluggish and depressing life changes the day a particularly charming young man becomes William's new obsession.<br><br>What becomes interesting is how this relationship allows William to learn more about himself through an initiatory journey, always fueled by increasingly potent psychoactive substances.<br>In essence, it's a film with beautiful cinematography, original transitions, but still a bit too long."
  },
  {
    "poster_image_id": 65,
    "title": "Spider-man: Across the Spider-Verse",
    "year": 2023,
    "director": "Joaquim Dos Santos, Kemp Powers, Justin K. Thompson",
    "review_by": "Sorenn",
    "content": "Across the Spider-Verse is a visually breathtaking and emotionally rich sequel that takes Miles Morales on a deeper, darker, and more ambitious multiversal journey. Directed by Joaquim Dos Santos, Kemp Powers, and Justin K. Thompson, the film expands on the original with stunning animation styles, powerful storytelling, and a brilliant soundtrack.<br><br>It dives into themes of identity, choice, and destiny, while introducing a vast array of new Spider-heroes — each with unique looks and personalities. Though it ends on a cliffhanger, the film still feels complete and thrilling throughout."
  },
  {
    "poster_image_id": 66,
    "title": "The Image You Missed",
    "year": 2018,
    "director": "Donal Foreman",
    "review_by": "Vickie",
    "content": "Imagine if your dad left you a dusty box of old movies instead of child support, and you had to psychoanalyze him through grainy footage of the Irish Troubles. That’s The Image You Missed. Dónal Foreman plays detective with his estranged father’s archives, war protests, bombs, and all while asking, “Dad, why’d you ghost me for politics?”. The Image You Missed redefines the essay film, and it’s a must-watch for anyone grappling with how history shapes identity, or why dads love cameras more than childcare."
  },
  {
    "poster_image_id": 67,
    "title": "The Danish Girl",
    "year": 2015,
    "director": "Tom Hooper",
    "review_by": "Sorenn",
    "content": "The Danish Girl, directed by Tom Hooper, is a poignant drama inspired by the true story of Lili Elbe, one of the first people to undergo gender confirmation surgery. Eddie Redmayne delivers a delicate and emotional performance as Lili, while Alicia Vikander shines as Gerda, her supportive and complex wife.<br><br>The film is visually stunning, with elegant cinematography and costume design. However, some critics felt it played things too safely and lacked deeper exploration of trans identity. Still, it's a moving portrayal of love, identity, and transformation."
  },
  {
    "poster_image_id": 69,
    "title": "The Rocky Horror Picture Show",
    "year": 1975,
    "director": "Jim Sharman",
    "review_by": "Vickie",
    "content": "Imagine if Dracula’s castle hosted Eurovision and the only contestants were horny aliens, a tap-dancing butler, and a scientist in thigh-highs. That’s Rocky Horror ! Follow Brad and Janet, two virgins as they stumble into a world where fishnets are mandatory. Tim Curry’s Frank-N-Furter is the chaotic bisexual aunt we all wish we had. The plot ? More holes than Frank’s stockings ! But who cares when you’ve got a dance called The Time Warp and audiences hurling toast at the screen for no reason."
  },
  {
    "poster_image_id": 70,
    "title": "The Seed of The Sacred Fig",
    "year": 2024,
    "director": "Mohammad Rasoulof",
    "review_by": "Sorenn",
    "content": "The Seed of the Sacred Fig, directed by Mohammad Rasoulof, is a powerful political drama that delves into the psychological impact of authoritarian regimes on family dynamics. The film follows Iman, an investigating judge in Tehran's Revolutionary Court, who becomes increasingly paranoid as nationwide protests intensify and his gun mysteriously disappears, leading him to suspect his own wife and daughters."
  },
  {
    "poster_image_id": 71,
    "title": "Tomboy",
    "year": "2011",
    "director": "Céline Sciamma",
    "review_by": "Vickie",
    "content": "A summer of stolen identity. A suburban pool, a dusty soccer field, the sticky heat of childhood before the world starts policing bodies. Tomboy follows 10 year old Laure, who becomes Mickaël for one golden season; binding her chest with tape, lowering her voice in the elevator, learning to spit like the boys do. Sciamma doesn't dramatize. She observes. The camera lingers on the intimate alchemy of self-creation : Mickaël practicing his walk in the mirror, the way his new friends slap his shoulder, the terrifying moment when his mother finally looks at him. There are no villains here, just the quiet violence of expectation — the way a swimsuit can feel like a sentence, how a haircut can be a revolution. Zoé Héran's performance is a miracle of subtlety. Watch how Mickaël's shoulders square when he's with the boys, how his posture collapses back into Laure at home. The most heartbreaking moment isn't confrontation : it's Mickaël's little sister, who knows the truth and protects it fiercely, because children understand secrets better than adults ever will. Tomboy doesn't argue. It simply bears witness to the brief, blazing freedom of becoming."
  },
  {
    "poster_image_id": 72,
    "title": "We Are Coming",
    "year": 2022,
    "director": "Nina Faure",
    "review_by": "Sorenn",
    "content": "We are coming is a documentary that goes with that first sentence: do women really have pleasure? It questions all the reasons why women can’t feel pleasure. Is it society? Patriarchy? Or just because of men?<br><br>Something has to change. Women have to know themselves and to not let the external world and their rules guide their lives. The revolution of women's pleasure has to start. It has already started, it has just to be shared and to raise awareness into everyone, women as men as nonbinary people. We Are Coming is not only a promesse, it’s also the enjoyment of pleasure where everything starts. It’s the final relief."
  },
  {
    "poster_image_id": 73,
    "title": "Young Hearts",
    "year": 2025,
    "director": "Anthony Schattman",
    "review_by": "Sorenn",
    "content": "A gentle and wholesome film for today’s queer youth. It addresses important and powerful topics that many queer children experience, who don’t always know how to open up in a world that often rejects them. The question of coming out is at the heart of the film, around the romance between the two young boys.<br><br>Simple, effective, with no explicit scenes or focus on the children’s ages, this film is aimed at both younger audiences and adults, whether queer individuals or parents who can take inspiration from the characters."
  },
  {
    "poster_image_id": 74,
    "title": "Yves Saint Laurent",
    "year": 2014,
    "director": "Jalil Lespert",
    "review_by": "Sorenn",
    "content": "Yves Saint Laurent, directed by Jalil Lespert, is a biographical drama that traces the rise of the iconic French fashion designer from his early days at Dior to the creation of his own fashion house. Pierre Niney gives a brilliant and elegant performance as Saint Laurent, capturing his genius, vulnerability, and inner turmoil.<br><br>The film is visually stunning, with beautiful costumes and stylish cinematography, but it sometimes prioritizes glamour over deeper emotional insight. Still, it offers a fascinating look into the world of high fashion and the man behind the legend.<br><br>Elegant and engaging, Yves Saint Laurent is a stylish tribute to a fashion icon."
  }
]